import { Flex } from "antd";

export const mentalHealthArticleContent = (
    <Flex vertical>
        <p>
            Ментальное здоровье — это состояние эмоционального, психологического
            и социального благополучия человека. Оно влияет на то, как мы
            думаем, чувствуем и действуем в повседневной жизни, а также на нашу
            способность справляться со стрессом, строить отношения и принимать
            решения. Забота о ментальном здоровье так же важна, как и
            поддержание физической формы, поскольку оно напрямую связано с
            качеством жизни.
        </p>

        <h2>Основные расстройства ментального здоровья</h2>
        <p>
            Существует множество различных нарушений ментального здоровья, но
            некоторые из них встречаются особенно часто:
        </p>
        <ul>
            <li>
                <strong>Депрессия</strong> — одно из самых распространённых
                расстройств, характеризующееся постоянным чувством грусти,
                апатией, потерей интереса к жизни и снижением энергии. Депрессия
                может повлиять на физическое здоровье и нарушить ежедневную
                деятельность.
            </li>
            <li>
                <strong>Тревожные расстройства</strong> — включают
                генерализованное тревожное расстройство, панические атаки и
                фобии. Проявляются чрезмерным беспокойством, напряжением и
                страхами, которые мешают нормальной жизни.
            </li>
            <li>
                <strong>Биполярное аффективное расстройство</strong> —
                характеризуется чередованием периодов сильной депрессии и мании
                (состояния чрезмерной активности и приподнятого настроения).
            </li>
            <li>
                <strong>Шизофрения и другие психотические расстройства</strong>{" "}
                — связаны с нарушением восприятия реальности, что может
                проявляться галлюцинациями, бредом и нарушением мышления.
            </li>
            <li>
                <strong>Расстройства пищевого поведения</strong> — такие как
                анорексия, булимия или компульсивное переедание. Они связаны с
                нарушением отношения человека к еде и восприятием своего тела.
            </li>
        </ul>

        <h2>Как следить за ментальным здоровьем</h2>
        <p>
            Поддержание ментального здоровья требует регулярной работы над собой
            и внимательного отношения к своему состоянию. Вот несколько простых,
            но эффективных шагов:
        </p>
        <ol>
            <li>
                <strong>Сон и питание</strong> — регулярный сон и
                сбалансированное питание оказывают огромное влияние на
                эмоциональное состояние. Недостаток сна и нездоровая пища могут
                усилить тревожность и стресс.
            </li>
            <li>
                <strong>Физическая активность</strong> — умеренные физические
                нагрузки, такие как прогулки, бег или йога, помогают снизить
                уровень стресса и улучшить настроение благодаря выделению
                эндорфинов.
            </li>
            <li>
                <strong>Эмоциональная грамотность</strong> — учитесь
                распознавать и выражать свои эмоции. Это поможет избежать
                накопления напряжения и стрессов.
            </li>
            <li>
                <strong>Социальная поддержка</strong> — общение с близкими
                людьми или участие в группах поддержки помогает справляться с
                трудностями и даёт чувство принадлежности.
            </li>
            <li>
                <strong>Психологическая помощь</strong> — не стоит стесняться
                обращаться к профессионалам, таким как психологи или
                психотерапевты, особенно если возникают затяжные проблемы с
                настроением или тревогой.
            </li>
            <li>
                <strong>Практики осознанности</strong> — медитация, дыхательные
                упражнения и техники релаксации помогают сосредоточиться на
                настоящем моменте и снижают уровень стресса.
            </li>
        </ol>

        <h2>Заключение</h2>
        <p>
            Ментальное здоровье — это не только отсутствие психических
            заболеваний, но и способность жить гармоничной и осмысленной жизнью.
            Регулярная забота о себе, внимательность к своим эмоциям и
            открытость к профессиональной помощи — ключи к крепкому ментальному
            здоровью и счастью. Помните, что забота о своей психике — это не
            признак слабости, а проявление мудрости и зрелости.
        </p>
    </Flex>
);

export const guideArticleContent = (
    <Flex vertical>
        <p>
            <b>MentalTracker</b> позволяет вам отслеживать состояние своего
            ментального здоровья, внося регулярные записи о своём самочувствии в
            определённые моменты времени.
        </p>
        <p>Вы можете отслеживать своё состояние по двум категориям:</p>
        <ul>
            <li>
                <b>Настроение</b> – эта категория позволяет анализировать,
                насколько вы чувствуете себя радостным, грустным или апатичным.
                Регулярное отслеживание настроения помогает выявить признаки
                депрессии, такие как длительная потеря интереса к любимым
                занятиям, упадок сил или безразличие к окружающему.
            </li>
            <li>
                <b>Тревожность</b> – эта категория фиксирует уровни тревоги и
                беспокойства. Постоянное ощущение тревоги может
                свидетельствовать о наличии тревожных расстройств, таких как
                генерализованное тревожное расстройство или панические атаки.
                Раннее обнаружение позволяет быстрее справиться с такими
                состояниями.
            </li>
        </ul>
        <p>
            Добавленные записи можно редактировать, если данные были указаны с
            ошибкой. Все введённые вами данные суммируются и отображаются в виде
            графика, который отражает динамику вашего состояния.
        </p>
        <p>
            Этот инструмент станет вашим помощником в мониторинге ментального
            здоровья, помогая вовремя замечать изменения и принимать меры для
            его укрепления.
        </p>
    </Flex>
);
